CITIES = [
    "تهران",
    "مشهد",
    "اصفهان",
    "کرج",
    "تبریز",
    "شیراز",
    "اهواز",
    "قم",
    "کرمانشاه",
    "رشت",
    "زاهدان",
    "کرمان",
    "ارومیه",
    "یزد",
    "سنندج",
    "همدان",
    "بندرعباس",
    "اردبیل",
    "ساری",
    "بجنورد",
]

BRANCHES = [
    {
        "branch": "مهندسی کامپیوتر",
        "expertise": [
            "نرم‌افزار",
            "هوش مصنوعی",
            "شبکه های کامپیوتری",
            "امنیت سایبری",
            "پردازش تصویر",
        ],
    },
    {
        "branch": "مهندسی برق",
        "expertise": ["الکترونیک", "قدرت", "کنترل", "مخابرات", "مدارهای مجتمع"],
    },
    {
        "branch": "مهندسی عمران",
        "expertise": [
            "سازه",
            "زیرساخت‌ها و ترابری",
            "محیط زیست",
            "آب و فاضلاب",
            "ژئوتکنیک",
        ],
    },
    {
        "branch": "مهندسی مکانیک",
        "expertise": [
            "طراحی جامدات",
            "تبدیل انرژی",
            "سیالات",
            "مکانیک پیشرفته",
            "مهندسی مواد",
        ],
    },
    {
        "branch": "مهندسی شیمی",
        "expertise": [
            "فرآیندهای شیمیایی",
            "مهندسی پلیمر",
            "مهندسی نفت",
            "مهندسی زیستی",
            "مهندسی محیط زیست",
        ],
    },
    {
        "branch": "علوم کامپیوتر",
        "expertise": [
            "الگوریتم‌ها",
            "بانک‌های اطلاعاتی",
            "معماری کامپیوتر",
            "هوش مصنوعی",
            "سیستم‌های عامل",
        ],
    },
    {
        "branch": "مهندسی صنایع",
        "expertise": [
            "سیستم‌های تولید",
            "مدیریت زنجیره تأمین",
            "بهینه‌سازی",
            "کنترل کیفیت",
            "مدیریت صنعتی",
        ],
    },
    {
        "branch": "مهندسی مواد",
        "expertise": ["سرامیک", "فلزات", "پلیمرها", "مواد پیشرفته", "نانومواد"],
    },
    {
        "branch": "مهندسی هوافضا",
        "expertise": [
            "طراحی هواپیما",
            "سیستم‌های فضایی",
            "مهندسی پیشرفته",
            "دینامیک پرواز",
            "کنترل هوافضا",
        ],
    },
    {
        "branch": "مهندسی نرم‌افزار",
        "expertise": [
            "طراحی و توسعه نرم‌افزار",
            "تست و ارزیابی نرم‌افزار",
            "مدیریت پروژه‌های نرم‌افزاری",
            "معماری نرم‌افزار",
            "مهندسی نیازمندی‌ها",
        ],
    },
]
